src/Documents/НачисленияСотрудникам/НачисленияСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачисленияСотрудникам</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафикаРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <recalculations>
    <name>Перерасчет</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Невыход</name>
      <description>Невыход</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
    <items>
      <name>Прог</name>
      <description>Зарплата программиста</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

src/Documents/НачисленияСотрудникам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаНачисления.Начислено;
	КонецЦикла;
	
	Движения.Начисления.Записать();
	
	Запрос = Новый Запрос( // select distinct так-то!
		"выбрать различные НачислСотр.Сотрудник
		|из Документ.НачисленияСотрудникам.Начисления как НачислСотр
		|где НачислСотр.Ссылка = &ТекущийДокумент");
		
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	ТбЗнач = Запрос.Выполнить().Выгрузить();
	Сотрудники = ТбЗнач.ВыгрузитьКолонку("Сотрудник");
	
	ПроведениеРасчетов.РассчитатьНачисления(Движения.Начисления,
		ПланыВидовРасчета.ОсновныеНачисления.Оклад, Сотрудники);
	Движения.Начисления.Записать(, Истина);
	
	ПроведениеРасчетов.РассчитатьНачисления(Движения.Начисления,
		ПланыВидовРасчета.ОсновныеНачисления.Премия, Сотрудники);
	Движения.Начисления.Записать(, Истина);
//	ПроведениеРассчетов.РассчитатьНачисления(Движения.Начисления,
//		ПланыВидовРасчета.ОсновныеНачисления.Оклад, Сотрудники);
КонецПроцедуры
